tap "anomalyco/tap"
tap "supabase/tap"
# Spell checker with better logic than ispell
brew "aspell"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Configurable static site generator
brew "hugo"
# Modular IRC client
brew "irssi"
# Rainbows and unicorns in your console!
brew "lolcat"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Your own personal AI assistant
brew "openclaw-cli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cartographic Projections Library
brew "proj"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Sparklines for the shell
brew "spark"
# Command-line tool for Stripe
brew "stripe-cli"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Supabase CLI
brew "supabase/tap/supabase"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Menu bar pomodoro timer
cask "tomatobar"
mas "AdGuard Mini", id: 1440147259
mas "Folders", id: 1593644229
mas "GIPHY CAPTURE", id: 668208984
mas "Hotspot Shield", id: 771076721
mas "PrettyJSON for Safari", id: 1445328303
mas "Save to Reader", id: 1640236961
mas "SiteSucker", id: 442168834
mas "Vimlike", id: 1584519802
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "anthropic.claude-code"
vscode "bierner.emojisense"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "box-of-hats.minify-selection"
vscode "bradlc.vscode-tailwindcss"
vscode "budparr.language-hugo-vscode"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "ecmel.vscode-html-css"
vscode "fivethree.vscode-hugo-snippets"
vscode "flyfly6.terminal-in-status-bar"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "gydunhn.hugo-essentials"
vscode "gydunhn.vsc-essentials-core"
vscode "hearhear.html-comment"
vscode "hookyqr.minify"
vscode "ibm.output-colorizer"
vscode "kevinrose.vsc-python-indent"
vscode "lokalise.i18n-ally"
vscode "mechatroner.rainbow-csv"
vscode "mefisto04.csv-viewer"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pioarduino.pioarduino-ide"
vscode "platformio.platformio-ide"
vscode "pucelle.vscode-css-navigation"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "rusnasonov.vscode-hugo"
vscode "tamasfe.even-better-toml"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "usernamehw.errorlens"
vscode "wholroyd.jinja"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
