# Spell checker with better logic than ispell
brew "aspell"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Configurable static site generator
brew "hugo"
# Modular IRC client
brew "irssi"
# Rainbows and unicorns in your console!
brew "lolcat"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Cartographic Projections Library
brew "proj"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Sparklines for the shell
brew "spark"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Menu bar pomodoro timer
cask "tomatobar"
mas "AdGuard Mini", id: 1440147259
mas "PrettyJSON for Safari", id: 1445328303
mas "Save to Reader", id: 1640236961
mas "Vimlike", id: 1584519802
